zephyrproject-rtos/hal_nxp/dts/nxp/mcx/MCXA166VLH-pinctrl.h
#define SmartDMA_PIO27_P3_27 A15X_MUX('3',27,10) /* PT3_27 */
#define WUU0_IN26_P3_28 A15X_MUX('3',28,0) /* PT3_28 */
#define P3_28 A15X_MUX('3',28,0) /* PT3_28 */
#define TRIG_IN11_P3_28 A15X_MUX('3',28,1) /* PT3_28 */
#define LPI2C3_SDA_P3_28 A15X_MUX('3',28,2) /* PT3_28 */
#define LPUART4_RXD_P3_28 A15X_MUX('3',28,3) /* PT3_28 */
#define TRIG_IN11/CT_INP12_P3_28_P3_28 A15X_MUX('3',28,4) /* PT3_28 */
#define CT_INP12_P3_28 A15X_MUX('3',28,4) /* PT3_28 */
#define CT3_MAT2_P3_28 A15X_MUX('3',28,5) /* PT3_28 */
#define PWM1_B3_P3_28 A15X_MUX('3',28,7) /* PT3_28 */
#define SmartDMA_PIO28_P3_28 A15X_MUX('3',28,10) /* PT3_28 */
#define ADC1_A22_P3_29 A15X_MUX('3',29,0) /* PT3_29 */
#define WUU0_IN27_P3_29 A15X_MUX('3',29,0) /* PT3_29 */
#define P3_29 A15X_MUX('3',29,0) /* PT3_29 */
#define ISPMODE_N_P3_29 A15X_MUX('3',29,1) /* PT3_29 */
#define LPI2C3_HREQ_P3_29 A15X_MUX('3',29,2) /* PT3_29 */
#define CT_INP3_P3_29 A15X_MUX('3',29,4) /* PT3_29 */
#define CT3_MAT3_P3_29 A15X_MUX('3',29,5) /* PT3_29 */
#define SmartDMA_PIO29_P3_29 A15X_MUX('3',29,10) /* PT3_29 */
#define P3_30 A15X_MUX('3',30,0) /* PT3_30 */
#define ADC1_A21_P3_30 A15X_MUX('3',30,0) /* PT3_30 */
#define TRIG_OUT6_P3_30 A15X_MUX('3',30,1) /* PT3_30 */
#define LPI2C3_SCLS_P3_30 A15X_MUX('3',30,2) /* PT3_30 */
#define LPUART4_RTS_B_P3_30 A15X_MUX('3',30,3) /* PT3_30 */
#define CT0_MAT2_P3_30 A15X_MUX('3',30,4) /* PT3_30 */
#define PWM1_A0_P3_30 A15X_MUX('3',30,7) /* PT3_30 */
#define SmartDMA_PIO30_P3_30 A15X_MUX('3',30,10) /* PT3_30 */
#define P3_31 A15X_MUX('3',31,0) /* PT3_31 */
#define ADC1_A20_P3_31 A15X_MUX('3',31,0) /* PT3_31 */
#define LPTMR0_ALT2_P3_31 A15X_MUX('3',31,0) /* PT3_31 */
#define TRIG_IN10_P3_31 A15X_MUX('3',31,1) /* PT3_31 */
#define LPI2C3_SDAS_P3_31 A15X_MUX('3',31,2) /* PT3_31 */
#define LPUART4_CTS_B_P3_31 A15X_MUX('3',31,3) /* PT3_31 */
#define CT0_MAT3_P3_31 A15X_MUX('3',31,4) /* PT3_31 */
#define PWM1_B0_P3_31 A15X_MUX('3',31,7) /* PT3_31 */
#define SmartDMA_PIO31_P3_31 A15X_MUX('3',31,10) /* PT3_31 */
#endif
